{
    "welcome_page_title": "Welcome & Setup",
    "welcome_page_header": "Before you begin...",
    "welcome_page_intro": "To help with our research on the usability of this tool, please provide some anonymous information. This will be stored securely and used only for academic purposes.",
    "research_tool_intro": "An advanced research tool for exploring the inner workings of Large Language Models.",
    "about_this_tool": "About This Tool",
    "research_study_info": "This application is part of a research study aiming to understand how users interact with and interpret complex AI models. By using this tool, you are participating in this study.",
    "your_role": "Your Role as a Participant:",
    "role_1": "You will use the different analysis tools to explore the behavior of a language model.",
    "role_2": "You will be asked to provide feedback on the usability and clarity of the visualizations.",
    "role_3": "Your interactions and feedback will help us build better, more transparent AI tools.",
    "data_privacy": "Data Privacy & Consent:",
    "privacy_1": "Your responses and interactions are anonymous. We will only store your age, expertise level, and feedback.",
    "privacy_2": "All collected data will be used exclusively for academic research purposes.",
    "privacy_3": "By proceeding, you consent to the collection and use of this anonymous data.",
    "tell_us_about_yourself": "Tell Us About Yourself",
    "what_is_your_age_group": "What is your age group?",
    "under_18": "Under 18",
    "18_24": "18-24",
    "25_34": "25-34",
    "35_44": "35-44",
    "45_54": "45-54",
    "55_64": "55-64",
    "65_or_over": "65 or over",
    "prefer_not_to_say": "Prefer not to say",
    "rate_your_expertise": "How would you rate your expertise with AI and language models?",
    "novice": "Novice (Limited to no experience with AI tools)",
    "intermediate": "Intermediate (Comfortable using AI for everyday tasks)",
    "expert": "Expert (Deep technical knowledge or research in AI)",
    "start_analysis_button": "Start Analysis",
    "form_submitted": "form_submitted",
    "thank_you_proceed": "Thank you! You can now proceed to the analysis.",
    "thank_you_main_suite": "Thank you! Loading the main analysis suite...",
    "welcome_to_llm_analysis_suite": "Welcome to the Explainable Language Interpretability Analysis Tool!",
    "toolkit_description": "This toolkit offers a collection of advanced methods to interpret and understand the inner workings of language models. Select an analysis from the sidebar to begin.",
    "attribution_analysis_description": "<strong>Attribution Analysis:</strong> Understand which parts of the input text influence the model's output using methods like Integrated Gradients, Occlusion, and Saliency.",
    "function_vectors_description": "<strong>Function Vectors:</strong> Analyze how text activates different functional capabilities within the model.",
    "circuit_tracing_description": "<strong>Circuit Tracing:</strong> Explore the computational pathways inside the model to see how information flows."
} 